In [1]:
import pandas as pd

a = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.Series(a)
df

A    [1, 2, 3]
B    [4, 5, 6]
dtype: object

In [2]:
a = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(a)
df

   A  B
0  1  4
1  2  5
2  3  6

In [3]:
df = pd.read_csv("D:\Py Django\sample.csv")
df

    Name Brand Model  number
0    BMW    B1   NaN  4545.0
1   Benz   NaN    w2  5645.0
2    NaN    A1    w3  8989.0
3    BMW    B1    w1     NaN
4   Benz   Be1    w2  3445.0
5    NaN    B1    w1    45.0
6   Benz   Be1   NaN  5656.0
7    NaN   Be1    w2  3445.0
8    BMW    B1    w1    45.0
9   Benz   Be1   NaN  5656.0
10  Benz   Be1   NaN  5656.0
11   NaN   Be1    w2  3445.0
12   BMW    B1    w1    45.0
13  Benz   Be1   NaN  5656.0

In [4]:
df = pd.read_csv("D:\Py Django\profit_and_loss.csv")
# df.head(10)
# df.tail(10)
df

    Year  Revenue  Expenses  Profit/Loss
0   2015    30000     35000        -5000
1   2016    35000     36000        -1000
2   2017    40000     38000         2000
3   2018    45000     42000         3000
4   2019    48000     50000        -2000
5   2020    50000     30000        20000
6   2021    60000     35000        25000
7   2022    70000     40000        30000
8   2023    80000     45000        35000
9   2024    90000     50000        40000
10  2025   100000    110000       -10000
11  2026   110000    120000       -10000
12  2027   120000     65000        55000
13  2028   130000    140000       -10000
14  2029   140000     75000        65000
15  2030   150000    160000       -10000

In [5]:
df = pd.read_csv("D:\Py Django\sample.csv")
bg = df.add_prefix("Car_")
bg.add_suffix("_2024")

   Car_Name_2024 Car_Brand_2024 Car_Model_2024  Car_number_2024
0            BMW             B1            NaN           4545.0
1           Benz            NaN             w2           5645.0
2            NaN             A1             w3           8989.0
3            BMW             B1             w1              NaN
4           Benz            Be1             w2           3445.0
5            NaN             B1             w1             45.0
6           Benz            Be1            NaN           5656.0
7            NaN            Be1             w2           3445.0
8            BMW             B1             w1             45.0
9           Benz            Be1            NaN           5656.0
10          Benz            Be1            NaN           5656.0
11           NaN            Be1             w2           3445.0
12           BMW             B1             w1             45.0
13          Benz            Be1            NaN           5656.0

In [6]:
df = pd.read_csv("D:\Py Django\sample.csv")

# Remove rows with any missing (NaN) values, but this doesn't modify the original DataFrame
df.dropna()

# Remove rows with any missing (NaN) values and modify the original DataFrame in place
df.dropna(inplace=True)

# Remove rows where there are missing values in the "Name" or "Model" columns
# This doesn't modify the original DataFrame, only returns a new one
df.dropna(subset=["Name","Model"])

# Replace all missing (NaN) values in the DataFrame with 0
# This doesn't modify the original DataFrame, only returns a new one
df.fillna(0)

# Replace all missing (NaN) values in the DataFrame with 0 and modify the original DataFrame
# The DataFrame 'df' is updated with NaN values replaced by 0
df.fillna(0, inplace=True)

# Replace missing (NaN) values in the "Name" column with the string "Tata"
# Modifies the "Name" column in the original DataFrame
df["Name"].fillna("Tata", inplace=True)

# Display the entire DataFrame
# Shows all rows and columns (subject to display settings)
df

C:\Users\91702\AppData\Local\Temp\ipykernel_17744\134903258.py:23: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Name"].fillna("Tata", inplace=True)

    Name Brand Model  number
4   Benz   Be1    w2  3445.0
8    BMW    B1    w1    45.0
12   BMW    B1    w1    45.0

In [7]:
df = pd.read_csv("D:\Py Django\sample.csv")
# Display a concise summary of the DataFrame, including column names, non-null counts, and data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Brand   13 non-null     object
 2   Model   9 non-null      object
 3   number  13 non-null     float64
dtypes: float64(1), object(3)
memory usage: 580.0+ bytes

In [8]:
df = pd.read_csv("D:\Py Django\sample.csv")
# Generate descriptive statistics for numerical columns, such as count, mean, std, min, max, etc.
# Only applies to numeric columns
df.describe()

            number
count    13.000000
mean   4021.000000
std    2688.043464
min      45.000000
25%    3445.000000
50%    4545.000000
75%    5656.000000
max    8989.000000

In [9]:
df = pd.read_csv("D:\Py Django\sample.csv")
# Count non-null values in each column of the DataFrame
df.count()

Name      10
Brand     13
Model      9
number    13
dtype: int64

In [10]:
df = pd.read_csv("D:\Py Django\sample.csv")

# Return a list of column names in the DataFrame
df.columns

Index(['Name', 'Brand', 'Model', 'number'], dtype='object')

In [11]:
df = pd.read_csv("D:\Py Django\sample.csv")
# Return a list of the DataFrame's axes (row index and column labels)
# axes[0] is the row index, axes[1] is the column labels
df.axes

[RangeIndex(start=0, stop=14, step=1),
 Index(['Name', 'Brand', 'Model', 'number'], dtype='object')]

In [12]:
df = pd.read_csv("D:\Py Django\sample.csv")
# Return a tuple representing the DataFrame's dimensions (rows, columns)
df.shape

(14, 4)

In [13]:
df = pd.read_csv("D:\Py Django\sample.csv")
#Replace all occurrences of "Benz" with "Mahindra" in the "Name" column of the DataFrame
df["Name"].replace("Benz", "Mahindra", inplace=True)    
df

C:\Users\91702\AppData\Local\Temp\ipykernel_17744\757287730.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Name"].replace("Benz", "Mahindra", inplace=True)

        Name Brand Model  number
0        BMW    B1   NaN  4545.0
1   Mahindra   NaN    w2  5645.0
2        NaN    A1    w3  8989.0
3        BMW    B1    w1     NaN
4   Mahindra   Be1    w2  3445.0
5        NaN    B1    w1    45.0
6   Mahindra   Be1   NaN  5656.0
7        NaN   Be1    w2  3445.0
8        BMW    B1    w1    45.0
9   Mahindra   Be1   NaN  5656.0
10  Mahindra   Be1   NaN  5656.0
11       NaN   Be1    w2  3445.0
12       BMW    B1    w1    45.0
13  Mahindra   Be1   NaN  5656.0

In [14]:
df = pd.read_csv("D:\Py Django\sample.csv")
# Select the row with index label 3 from the DataFrame
df.loc[3]

Name      BMW
Brand      B1
Model      w1
number    NaN
Name: 3, dtype: object

In [15]:
df = pd.read_csv("D:\Py Django\sample.csv")
# Define a dictionary to map old column names to new column names
x = {"Brand":"Brand_Name"}
df.rename(columns=x)

    Name Brand_Name Model  number
0    BMW         B1   NaN  4545.0
1   Benz        NaN    w2  5645.0
2    NaN         A1    w3  8989.0
3    BMW         B1    w1     NaN
4   Benz        Be1    w2  3445.0
5    NaN         B1    w1    45.0
6   Benz        Be1   NaN  5656.0
7    NaN        Be1    w2  3445.0
8    BMW         B1    w1    45.0
9   Benz        Be1   NaN  5656.0
10  Benz        Be1   NaN  5656.0
11   NaN        Be1    w2  3445.0
12   BMW         B1    w1    45.0
13  Benz        Be1   NaN  5656.0

In [16]:
df = pd.DataFrame({"A":[1,2,3], "B":[4,5,6], "C":[7,8,9]})
df.eval('D = (A + B) * C', inplace=True)
df #learn pyspark

   A  B  C   D
0  1  4  7  35
1  2  5  8  56
2  3  6  9  81

velocitycode --> a for america, b for brazil , c for etc,countryname
1-25 --> less quantity
above 25 --> minimum quantity

In [17]:
df =pd.DataFrame({'name':['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
                  'marks':['85', '92', '78', '90', '88'],
                 'age':[24, 27, None, 32, 29],
                  'passed': [True, True, False, True, True]})

print(df.dtypes)
df


df_clean = df.convert_dtypes()
df_clean
print(df_clean.dtypes)

name       object
marks      object
age       float64
passed       bool
dtype: object
name      string[python]
marks     string[python]
age                Int64
passed           boolean
dtype: object

In [18]:
df = pd.read_csv("D:\Py Django\sample.csv")
df.drop_duplicates(inplace=True)
df

   Name Brand Model  number
0   BMW    B1   NaN  4545.0
1  Benz   NaN    w2  5645.0
2   NaN    A1    w3  8989.0
3   BMW    B1    w1     NaN
4  Benz   Be1    w2  3445.0
5   NaN    B1    w1    45.0
6  Benz   Be1   NaN  5656.0
7   NaN   Be1    w2  3445.0
8   BMW    B1    w1    45.0

In [32]:
bg = pd.read_csv("D:\Py Django\sample.csv")
# bg.isnull()
bg.isnull().sum()

Name      4
Brand     1
Model     5
number    1
dtype: int64

In [20]:
data = {'name': ['Alice', 'Bob', 'Charlie'],
        "qualified": [True, False, True]}
df = pd.DataFrame(data)
newdf = df.copy()
df.rename(columns={"name": "Username" ,"qualified":"is_qualified"}, inplace=True)
print(df)
newdf

  Username  is_qualified
0    Alice          True
1      Bob         False
2  Charlie          True

      name  qualified
0    Alice       True
1      Bob      False
2  Charlie       True

90-100 --> A+(average marks)
80-90 --> A
student_marks.csv

In [33]:
df = pd.read_csv("D:\Py Django\sample.csv")

df.empty

False

In [22]:
df = pd.DataFrame({'name': ['Alice', 'Bob', 'Charlie'],
                 'marks': [85, 92, 78],'students_marks':['85','92','78']})

result = df['name'].eq('Alice')
print(result)

dd = pd.read_csv("D:\Py Django\student_marks.csv")
bg = dd["Unnamed: 0"].eq('Jennifer')
dd[bg]

0     True
1    False
2    False
Name: name, dtype: bool

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53

In [23]:
data1 = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
            'Age': [24, 27, 22, 32, 29],
            'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']}
df1 = pd.DataFrame(data1)
data2 = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
            'Age': [24, 27, 22, 32, 29],
            'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']}
df2 = pd.DataFrame(data2)
# df1.equals(df2)
df1["Name"].equals(df2["Name"])

True

In [24]:
s1 = pd.Series([1, 2, 3])
s2 = pd.Series([4, 5, 6])

result = s1.dot(s2)
result

np.int64(32)

In [25]:
d1 = pd.DataFrame([[1, 2, 3], [4, 5, 6]])
d2 = pd.DataFrame([[7, 8, 9], [10, 11, 12], [13,14,15]])
print(d1)
print("")
print(d2)
print("")
print(d1.dot(d2))

   0  1  2
0  1  2  3
1  4  5  6

    0   1   2
0   7   8   9
1  10  11  12
2  13  14  15

     0    1    2
0   66   72   78
1  156  171  186

In [ ]:
df = pd.read_csv("D:\Py Django\student_marks.csv")
df.rename(columns={"Unnamed: 0":"Student_Name"}, inplace=True)
df["Total Marks"] = df.select_dtypes(include='int').sum(axis=1)
# df.filter(items=["Student_Name", "Total Marks"])
df.get(["Student_Name", "Total Marks"])

  Student_Name  Total Marks
0         John          470
1       Suresh          524
2       Ramesh          556
3      Jessica          586
4     Jennifer          587
5         Annu          556
6        pooja          496
7       Ritesh          517
8        Farha          587
9       Mukesh          566

In [27]:
data = {'name': ['Alice', 'Bob', 'Charlie'],
        "qualified": [True, False, True]}

df = pd.DataFrame(data)
df
newdf = df.drop(index=[0],axis = 0)
newdf

      name  qualified
1      Bob      False
2  Charlie       True

In [28]:
import pandas as pd
df = pd.read_csv("D:\Py Django\Inventory_v2.csv")
df

,product.partNumber,location.locationIdentifier,inventoryType,quantity,quantityUnits,value,valueCurrency,reservationOrders,daysOfSupply,shelfLife,...,quantityUpperThreshold,quantityLowerThreshold,daysOfSupplyUpperThreshold,daysOfSupplyLowerThreshold,expiringThreshold,plannerCode,velocityCode,inventoryParentType,class,segment
0,PS-SL-A287,LT-1,PRODUCT,25,EA,31250.0,USD,2,19.0,365.0,...,100,10,30,10,NaN,Street Lighting,B,ONHAND,NEW,INDUSTRIAL
1,PS-SL-A288,LT-1,PRODUCT,20,EA,25000.0,USD,2,35.0,365.0,...,100,10,30,10,NaN,Street Lighting,B,ONHAND,NEW,INDUSTRIAL
2,PS-SL-H309,LT-1,PRODUCT,3,EA,3750.0,USD,2,14.0,365.0,...,100,10,30,10,NaN,Street Lighting,B,ONHAND,NEW,INDUSTRIAL
3,PS-SL-H310,LT-1,PRODUCT,35,EA,43750.0,USD,2,16.0,365.0,...,100,10,30,10,NaN,Street Lighting,A,ONHAND,NEW,INDUSTRIAL
4,PS-SL-F342,LT-1,PRODUCT,43,EA,53750.0,USD,2,42.0,365.0,...,100,10,30,10,NaN,Street Lighting,A,ONHAND,NEW,INDUSTRIAL
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
153,9664147,LT-2,ITEM,27,EA,26352.0,USD,0,56.0,365.0,...,400,100,30,10,NaN,Secondary Chassis,A,ONHAND,NEW,NaN
154,9664147,LT-2,ITEM,27,EA,26352.0,USD,0,56.0,365.0,...,400,100,30,10,NaN,Secondary Chassis,A,ONHAND,NEW,NaN
155,9664147,LT-2,ITEM,27,EA,26352.0,USD,0,56.0,365.0,...,400,100,30,10,NaN,Secondary Chassis,A,ONHAND,NEW,NaN
156,9664147,LT-2,ITEM,27,EA,26352.0,USD,0,56.0,365.0,...,400,100,30,10,NaN,Secondary Chassis,A,ONHAND,NEW,NaN
157,9664147,LT-2,ITEM,27,EA,26352.0,USD,0,56.0,365.0,...,400,100,30,10,NaN,Secondary Chassis,A,ONHAND,NEW,NaN

In [29]:
import pandas as pd

def qq(qty):
    if qty < 26:
        return "Less Min"
    else:
        return "Min Level"

df = pd.read_csv(r"D:\Py Django\Inventory_v2.csv")


df["Status"] = df["quantity"].apply(qq)  
df

,product.partNumber,location.locationIdentifier,inventoryType,quantity,quantityUnits,value,valueCurrency,reservationOrders,daysOfSupply,shelfLife,...,quantityLowerThreshold,daysOfSupplyUpperThreshold,daysOfSupplyLowerThreshold,expiringThreshold,plannerCode,velocityCode,inventoryParentType,class,segment,Status
0,PS-SL-A287,LT-1,PRODUCT,25,EA,31250.0,USD,2,19.0,365.0,...,10,30,10,NaN,Street Lighting,B,ONHAND,NEW,INDUSTRIAL,Less Min
1,PS-SL-A288,LT-1,PRODUCT,20,EA,25000.0,USD,2,35.0,365.0,...,10,30,10,NaN,Street Lighting,B,ONHAND,NEW,INDUSTRIAL,Less Min
2,PS-SL-H309,LT-1,PRODUCT,3,EA,3750.0,USD,2,14.0,365.0,...,10,30,10,NaN,Street Lighting,B,ONHAND,NEW,INDUSTRIAL,Less Min
3,PS-SL-H310,LT-1,PRODUCT,35,EA,43750.0,USD,2,16.0,365.0,...,10,30,10,NaN,Street Lighting,A,ONHAND,NEW,INDUSTRIAL,Min Level
4,PS-SL-F342,LT-1,PRODUCT,43,EA,53750.0,USD,2,42.0,365.0,...,10,30,10,NaN,Street Lighting,A,ONHAND,NEW,INDUSTRIAL,Min Level
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
153,9664147,LT-2,ITEM,27,EA,26352.0,USD,0,56.0,365.0,...,100,30,10,NaN,Secondary Chassis,A,ONHAND,NEW,NaN,Min Level
154,9664147,LT-2,ITEM,27,EA,26352.0,USD,0,56.0,365.0,...,100,30,10,NaN,Secondary Chassis,A,ONHAND,NEW,NaN,Min Level
155,9664147,LT-2,ITEM,27,EA,26352.0,USD,0,56.0,365.0,...,100,30,10,NaN,Secondary Chassis,A,ONHAND,NEW,NaN,Min Level
156,9664147,LT-2,ITEM,27,EA,26352.0,USD,0,56.0,365.0,...,100,30,10,NaN,Secondary Chassis,A,ONHAND,NEW,NaN,Min Level
157,9664147,LT-2,ITEM,27,EA,26352.0,USD,0,56.0,365.0,...,100,30,10,NaN,Secondary Chassis,A,ONHAND,NEW,NaN,Min Level